-- таблица Employees

-- создать таблицу
create table employees(
	id serial primary key,
	employee_name varchar(50) not null
);

-- посмотреть таблицу
select * from employees;

-- наполнить таблицу значениями
insert into employees(employee_name) values
	('Лев'), --1
	('Дарья'), --2
	('Ульяна'), --3
	('Камилла'), --4
	('Илья'), --5
	('Иван'), --6
	('Алиса'), --7
	('Мия'), --8
	('Софья'), --9
	('Юлия'), --10
	('Всеволод'), --11
	('Полина'), --12
	('Александра'), --13
	('Дмитрий'), --14
	('Мария'), --15
	('Ольга'), --16
	('Савва'), --17
	('Матвей'), --18
	('Анастасия'), --19
	('София'), --20
	('Злата'), --21
	('Фёдор'), --22
	('Амина'), --23
	('Диана'), --24
	('Екатерина'), --25
	('Лидия'), --26
	('Мила'), --27
	('Богдан'), --28
	('Захар'), --29
	('Андрей'), --30
	('Андрей'), --31
	('Василиса'), --32
	('Роман'), --33
	('Даниил'), --34
	('Елизавета'), --35
	('Владислава'), --36
	('Виктория'), --37
	('Елисей'), --38
	('Ксения'), --39
	('Оливия'), --40
	('Николай'), --41
	('Евгений'), --42
	('Гордей'), --43
	('Михаил'), --44
	('Руслан'), --45
	('Максим'), --46
	('Константин'), --47
	('Ева'), --48
	('Александр'), --49
	('Кирилл'), --50
	('Давид'), --51
	('Артур'), --52
	('Анна'), --53
	('Марк'), --54
	('Алексей'), --55
	('Алина'), --56
	('Варвара'), --57
	('Владимир'), --58
	('Тихон'), --59
	('Сергей'), --60
	('Артём'), --61
	('Татьяна'), --62
	('Степан'), --63
	('Арсений'), --64
	('Дарина'), --65
	('Милана'), --66
	('Сафия'), --67
	('Ярослав'), --68
	('Кристина'), --69
	('Тимофей') --70
;



-- таблица Salary

-- создать таблицу
create table salary(
	id serial primary key,
	monthly_salary int not null
);

-- посмотреть таблицу
select * from salary;

-- наполнить таблицу значениями
insert into salary(monthly_salary) values
	('1000'), --1
	('1100'), --2
	('1200'), --3
	('1300'), --4
	('1400'), --5
	('1500'), --6
	('1600'), --7
	('1700'), --8
	('1800'), --9
	('1900'), --10
	('2000'), --11
	('2100'), --12
	('2200'), --13
	('2300'), --14
	('2400')  --15
;



-- таблица employee_salary 
 
-- создать таблицу
create table employee_salary(
	id serial primary key,
	employee_id int not null unique,
	salary_id int not null
);

-- посмотреть таблицу
select * from employee_salary;

-- наполнить таблицу значениями
insert into employee_salary(employee_id, salary_id) values
	('96','14'), --1 _ несуществующие employee_id
	('60','7'), --2
	('27','14'), --3
	('57','7'), --4
	('28','15'), --5
	('56','5'), --6
	('66','9'), --7
	('76','5'), --8 _ несуществующие employee_id
	('88','2'), --9 _ несуществующие employee_id
	('38','14'), --10
	('26','8'), --11
	('25','13'), --12
	('7','9'), --13
	('19','5'), --14
	('36','8'), --15
	('8','3'), --16
	('74','6'), --17 _ несуществующие employee_id
	('90','10'), --18 _ несуществующие employee_id
	('95','10'), --19 _ несуществующие employee_id
	('6','1'), --20
	('16','6'), --21
	('45','9'), --22
	('10','13'), --23
	('39','13'), --24
	('81','4'), --25 _ несуществующие employee_id
	('23','12'), --26
	('64','13'), --27
	('30','9'), --28
	('24','2'), --29
	('72','14'), --30 _ несуществующие employee_id
	('20','13'), --31
	('9','12'), --32
	('80','12'), --33 _ несуществующие employee_id
	('73','13'), --34 _ несуществующие employee_id
	('52','2'), --35
	('42','11'), --36
	('63','9'), --37
	('14','5'), --38
	('31','8') --39
;



-- таблица roles

-- создать таблицу
create table roles(
	id serial primary key,
	role_name int not null unique
);

-- посмотреть таблицу
select * from roles;

-- поменять тип столбца
alter table roles alter column role_name type varchar(30);

-- наполнить таблицу значениями
insert into roles(role_name) values
	('Junior Python developer'), --1
	('Middle Python developer'), --2
	('Senior Python developer'), --3
	('Junior Java developer'), --4
	('Middle Java developer'), --5
	('Senior Java developer'), --6
	('Junior JavaScript developer'), --7
	('Middle JavaScript developer'), --8
	('Senior JavaScript developer'), --9
	('Junior Manual QA engineer'), --10
	('Middle Manual QA engineer'), --11
	('Senior Manual QA engineer'), --12
	('Project Manager'), --13
	('Designer'), --14
	('HR'), --15
	('CEO'), --16
	('Sales manager'), --17
	('Junior Automation QA engineer'), --18
	('Middle Automation QA engineer'), --19
	('Senior Automation QA engineer')  --20
;



-- таблица roles_employee 

-- создать таблицу
create table roles_employee(
	id serial primary key,
	employee_id int not null unique 
		references employees(id),
	role_id int not null
		references roles(id)
);

-- посмотреть таблицу
select * from roles_employee;

-- наполнить таблицу
insert into roles_employee(employee_id, role_id) values
	('9','16'), --1
	('68','7'), --2
	('63','17'), --3
	('43','5'), --4
	('39','10'), --5
	('57','8'), --6
	('5','19'), --7
	('29','19'), --8
	('6','8'), --9
	('41','2'), --10
	('55','20'), --11
	('26','13'), --12
	('31','1'), --13
	('35','2'), --14
	('23','1'), --15
	('51','16'), --16
	('11','20'), --17
	('12','13'), --18 
	('27','17'), --19
	('44','6'), --20
	('67','5'), --21
	('34','8'), --22
	('59','3'), --23
	('64','2'), --24
	('3','17'), --25
	('47','13'), --26
	('36','19'), --27
	('62','8'), --28
	('10','12'), --29
	('52','2'), --30
	('65','17'), --31
	('24','7'), --32
	('37','3'), --33
	('33','15'), --34
	('42','17'), --35
	('15','19'), --36
	('46','17'), --37
	('48','16'), --38
	('8','9'), --39
	('30','18') --40
;




-- очиcтить в BD
drop table employee_salary;